{
  "HEN-Q1": "The major components of the software include: requirements gathering, design, development, testing, deployment, and maintenance.\n\n1. Web-based Single Page App (SPA)\n2. Graph creation and editing (nodes and edges)\n3. GraphML/GXL export for data sharing\n4. JSON-based import and export for active graph creation\n5. Data visualization (stretch goal)\n6. Interactive graph visualization (stretch goal)\n7. GraphML/XML importing into editing (stretch goal)\n8. Data visualization interfacing (e.g., filtering, queries, etc.) (stretch goal)",
  "HEN-Q2": "Yes, there is a 'workflow order' that allows work to be broken down. The typical workflow order is: requirements gathering, design, development, testing, deployment, and maintenance.\n\nCreate or import graph (using JSON or GraphML)\n2. Add or edit nodes and edges\n3. Save and load graph progress\n4. Export graph in GraphML format for sharing\n5. Visualize graph data (if visualization feature is implemented)\n6. Interact with the graph visualization (if interactive feature is implemented)\n7. Export graph visualization as an image (if visualization feature is implemented)",
  "HEN-Q3": "Dependencies may exist between different tasks or features in the project. To trace and track these dependencies, the team can use project management software, dependency mapping, or a work breakdown structure.",
  "HEN-Q4": " Work will be estimated in timeframes by using techniques such as expert judgment, analogy-based estimation, parametric estimation, or a combination of these methods.",
  "HEN-Q5": "The plan to communicate project progress can include regular status updates, progress reports, and meetings to discuss work accomplished compared to the total plan.",
  "HEN-Q6": "Yes, there is a team. Work will be divided up based on individual skills and expertise, and team members will be informed of project updates and changes through regular communication channels, such as meetings, emails, or collaboration tools.",
  "HEN-Q7": "",
  "HEN-Q8": "",
  "HEN-Q9": "",
  "HEN-Q10": "The priority of each unit of work will be determined by factors such as business value, dependencies, resource availability, and risk.",
  "HEN-Q11": "Criteria used to evaluate the success of each unit of work can include: completion within the allocated timeframe, meeting quality standards, fulfilling functional requirements, and alignment with overall project goals.",
  "HEN-Q12": " The progress of each unit of work will be monitored through regular status updates, progress reports, and meetings to ensure work is on track and any issues are addressed promptly.",
  "HEN-Q13": "Key performance indicators (KPIs) for each unit of work can include: completion rate, defect rate, time to complete, and customer satisfaction.",
  "HEN-Q14": "Expected outcomes/impacts/deliverables for each unit of work will vary depending on the specific tasks and objectives, but may include documentation, working software, test results, and deployment plans.",
  "HEN-Q15": "Feedback from stakeholders can be incorporated into the project through regular stakeholder meetings, surveys, or other channels for gathering input, and can be incorporated as needed based on project milestones or phases.",
  "HEN-Q16": "",
  "HEN-Q17": "",
  "HEN-Q18": "",
  "HEN-Q19": "The timeline for completing each unit of work will depend on factors such as complexity, resources, and dependencies. Timelines should be established and monitored throughout the project to ensure timely completion.\n\nThe project timeline is divided into several development stages:\nMVP: Creation, editing, exporting, and importing of graph objects\nMVCR: GraphML/XML template, dynamic attribute templates, and auto-rendering\nMVCR+1: Dynamic attribute collection during object creation/editing\nMVCR+2: Data visualization of graph objects and image export\nMVCR+2.5: Data visualization UI for move/zoom/etc.\nMVCR+3: GraphML/XML importing into editing\nMVCR+4: Data visualization interfacing (e.g., filtering, queries, etc.)",
  "HEN-Q20": "Resources will be allocated to ensure the timely completion of each unit of work by prioritizing tasks, assigning appropriate team members, and adjusting resources as needed to maintain progress.",
  "HEN-Q21": "The team can maintain focus and momentum throughout the project by setting clear goals and expectations, maintaining regular communication, and addressing challenges and issues in a timely manner.",
  "HEN-Q22": "Tools or techniques used to manage time, resources, and risks effectively can include project management software, time tracking tools, resource allocation tools, and risk management methodologies.",
  "HEN-Q23": "The team can ensure that deadlines are met and the project stays on track by monitoring progress, addressing issues and challenges as they arise, and adjusting plans and resources as needed to maintain momentum.",
  "HEN-Q24": "",
  "HEN-Q25": "",
  "HENQuestionsTitle": "SPA GraphML Editor"
}